[Killed] BlockStatement
src/Graph.js:2:34
 export default class Graph {
-    constructor(incidenceMatrix) {
-        this.incidenceMatrix = incidenceMatrix;
-        this.numVertices = incidenceMatrix.length;
-        this.numEdges = incidenceMatrix[0] ? incidenceMatrix[0].length : 0;
-    }
+    constructor(incidenceMatrix) {}
     
     // Преобразование матрицы инцидентности в список связности
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: adjList[v] is not iterable

[Killed] BlockStatement
src/Graph.js:9:18
     }
     
     // Преобразование матрицы инцидентности в список связности
-    toEdgeList() {
-        const edgeList = [];
-        for (let e = 0; e < this.numEdges; e++) {
-            let v1 = -1, v2 = -1;
-            for (let v = 0; v < this.numVertices; v++) {
-                if (this.incidenceMatrix[v][e] === 1) {
-                    if (v1 === -1) {
-                        v1 = v;
-                        continue
-                    }
-                    else {
-                        v2 = v;
-                        break;
-                    } 
-                }
-            }
-            if (true && v2 !== -1) {
-                edgeList.push([v1, v2]);
-            }
-        }
-        return edgeList;
-    }
+    toEdgeList() {}
 
     // Преобразование матрицы смежности в матрицу инцидентности
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading 'reduce')

[Killed] BlockStatement
src/Graph.js:11:49
     // Преобразование матрицы инцидентности в список связности
     toEdgeList() {
         const edgeList = [];
-        for (let e = 0; e < this.numEdges; e++) {
-            let v1 = -1, v2 = -1;
-            for (let v = 0; v < this.numVertices; v++) {
-                if (this.incidenceMatrix[v][e] === 1) {
-                    if (v1 === -1) {
-                        v1 = v;
-                        continue
-                    }
-                    else {
-                        v2 = v;
-                        break;
-                    } 
-                }
-            }
-            if (true && v2 !== -1) {
-                edgeList.push([v1, v2]);
-            }
-        }
+        for (let e = 0; e < this.numEdges; e++) {}
         return edgeList;
     }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] EqualityOperator
src/Graph.js:11:25
     // Преобразование матрицы инцидентности в список связности
     toEdgeList() {
         const edgeList = [];
-        for (let e = 0; e < this.numEdges; e++) {
+        for (let e = 0; e >= this.numEdges; e++) {
             let v1 = -1, v2 = -1;
             for (let v = 0; v < this.numVertices; v++) {
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] UnaryOperator
src/Graph.js:12:31
     toEdgeList() {
         const edgeList = [];
         for (let e = 0; e < this.numEdges; e++) {
-            let v1 = -1, v2 = -1;
+            let v1 = -1, v2 = +1;
             for (let v = 0; v < this.numVertices; v++) {
                 if (this.incidenceMatrix[v][e] === 1) {
killedBy: ChaiGraphTest toEdgeList() с numEdges = 1
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  []
Received:
  [[-1, 1]]

Message:

[Killed] UnaryOperator
src/Graph.js:12:22
     toEdgeList() {
         const edgeList = [];
         for (let e = 0; e < this.numEdges; e++) {
-            let v1 = -1, v2 = -1;
+            let v1 = +1, v2 = -1;
             for (let v = 0; v < this.numVertices; v++) {
                 if (this.incidenceMatrix[v][e] === 1) {
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] EqualityOperator
src/Graph.js:13:29
         const edgeList = [];
         for (let e = 0; e < this.numEdges; e++) {
             let v1 = -1, v2 = -1;
-            for (let v = 0; v < this.numVertices; v++) {
+            for (let v = 0; v >= this.numVertices; v++) {
                 if (this.incidenceMatrix[v][e] === 1) {
                     if (v1 === -1) {
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] UpdateOperator
src/Graph.js:13:51
         const edgeList = [];
         for (let e = 0; e < this.numEdges; e++) {
             let v1 = -1, v2 = -1;
-            for (let v = 0; v < this.numVertices; v++) {
+            for (let v = 0; v < this.numVertices; v--) {
                 if (this.incidenceMatrix[v][e] === 1) {
                     if (v1 === -1) {
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/Graph.js:14:21
         for (let e = 0; e < this.numEdges; e++) {
             let v1 = -1, v2 = -1;
             for (let v = 0; v < this.numVertices; v++) {
-                if (this.incidenceMatrix[v][e] === 1) {
+                if (false) {
                     if (v1 === -1) {
                         v1 = v;
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] EqualityOperator
src/Graph.js:14:21
         for (let e = 0; e < this.numEdges; e++) {
             let v1 = -1, v2 = -1;
             for (let v = 0; v < this.numVertices; v++) {
-                if (this.incidenceMatrix[v][e] === 1) {
+                if (this.incidenceMatrix[v][e] !== 1) {
                     if (v1 === -1) {
                         v1 = v;
killedBy: ChaiGraphTest toEdgeList() с матрицей содержащей 1
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  [[0, 1]]
Received:
  []

Message:

[Killed] BlockStatement
src/Graph.js:15:36
             let v1 = -1, v2 = -1;
             for (let v = 0; v < this.numVertices; v++) {
                 if (this.incidenceMatrix[v][e] === 1) {
-                    if (v1 === -1) {
-                        v1 = v;
-                        continue
-                    }
+                    if (v1 === -1) {}
                     else {
                         v2 = v;
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] UnaryOperator
src/Graph.js:15:32
             let v1 = -1, v2 = -1;
             for (let v = 0; v < this.numVertices; v++) {
                 if (this.incidenceMatrix[v][e] === 1) {
-                    if (v1 === -1) {
+                    if (v1 === +1) {
                         v1 = v;
                         continue
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/Graph.js:19:26
                         v1 = v;
                         continue
                     }
-                    else {
-                        v2 = v;
-                        break;
-                    } 
+                    else {} 
                 }
             }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ConditionalExpression
src/Graph.js:25:25
                     } 
                 }
             }
-            if (true && v2 !== -1) {
+            if (true && true) {
                 edgeList.push([v1, v2]);
             }
killedBy: ChaiGraphTest toEdgeList() с numEdges = 1
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  []
Received:
  [[-1, -1]]

Message:

[Killed] ConditionalExpression
src/Graph.js:25:17
                     } 
                 }
             }
-            if (true && v2 !== -1) {
+            if (true) {
                 edgeList.push([v1, v2]);
             }
killedBy: ChaiGraphTest toEdgeList() с numEdges = 1
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  []
Received:
  [[-1, -1]]

Message:

[Killed] BlockStatement
src/Graph.js:33:44
     }
 
     // Преобразование матрицы смежности в матрицу инцидентности
-    static adjacencyToIncidence(adjMatrix) {
-        const n = adjMatrix.length;
-        const edges = [];
-        for (let i = 0; i < n; i++) {
-            for (let j = i + 1; j < n; j++) {
-                if (adjMatrix[i][j]) {
-                    edges.push([i, j]);
-                }
-            }
-        }
-
-        const incMatrix = Array.from({ length: n }, () => Array(edges.length).fill(0));
-        edges.forEach(([v1, v2], e) => {
-            incMatrix[v1][e] = 1;
-            incMatrix[v2][e] = 1;
-        });
-
-        return incMatrix;
-    }
+    static adjacencyToIncidence(adjMatrix) {}
 
     // Проверка на связность (DFS)
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Graph.js:36:37
     static adjacencyToIncidence(adjMatrix) {
         const n = adjMatrix.length;
         const edges = [];
-        for (let i = 0; i < n; i++) {
-            for (let j = i + 1; j < n; j++) {
-                if (adjMatrix[i][j]) {
-                    edges.push([i, j]);
-                }
-            }
-        }
+        for (let i = 0; i < n; i++) {}
 
         const incMatrix = Array.from({ length: n }, () => Array(edges.length).fill(0));
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] UpdateOperator
src/Graph.js:36:32
     static adjacencyToIncidence(adjMatrix) {
         const n = adjMatrix.length;
         const edges = [];
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; i < n; i--) {
             for (let j = i + 1; j < n; j++) {
                 if (adjMatrix[i][j]) {
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/Graph.js:37:45
         const n = adjMatrix.length;
         const edges = [];
         for (let i = 0; i < n; i++) {
-            for (let j = i + 1; j < n; j++) {
-                if (adjMatrix[i][j]) {
-                    edges.push([i, j]);
-                }
-            }
+            for (let j = i + 1; j < n; j++) {}
         }
 
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ArithmeticOperator
src/Graph.js:37:26
         const n = adjMatrix.length;
         const edges = [];
         for (let i = 0; i < n; i++) {
-            for (let j = i + 1; j < n; j++) {
+            for (let j = i - 1; j < n; j++) {
                 if (adjMatrix[i][j]) {
                     edges.push([i, j]);
killedBy: ChaiGraphTest adjacencyToIncidence() с j = i -1
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  [[1], [1]]
Received:
  [[1, 1], [1, 1]]

Message:

[Killed] BlockStatement
src/Graph.js:38:38
         const edges = [];
         for (let i = 0; i < n; i++) {
             for (let j = i + 1; j < n; j++) {
-                if (adjMatrix[i][j]) {
-                    edges.push([i, j]);
-                }
+                if (adjMatrix[i][j]) {}
             }
         }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ConditionalExpression
src/Graph.js:38:21
         const edges = [];
         for (let i = 0; i < n; i++) {
             for (let j = i + 1; j < n; j++) {
-                if (adjMatrix[i][j]) {
+                if (true) {
                     edges.push([i, j]);
                 }
killedBy: ChaiGraphTest isNotConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  false
Received:
  true

Message:

[Killed] ArrowFunction
src/Graph.js:44:53
             }
         }
 
-        const incMatrix = Array.from({ length: n }, () => Array(edges.length).fill(0));
+        const incMatrix = Array.from({ length: n }, () => undefined);
         edges.forEach(([v1, v2], e) => {
             incMatrix[v1][e] = 1;
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] BlockStatement
src/Graph.js:45:40
         }
 
         const incMatrix = Array.from({ length: n }, () => Array(edges.length).fill(0));
-        edges.forEach(([v1, v2], e) => {
-            incMatrix[v1][e] = 1;
-            incMatrix[v2][e] = 1;
-        });
+        edges.forEach(([v1, v2], e) => {});
 
         return incMatrix;
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] BlockStatement
src/Graph.js:54:19
     }
 
     // Проверка на связность (DFS)
-    isConnected() {
-        if (this.numVertices === 0) return true;
-
-        const visited = new Array(this.numVertices).fill(false);
-        const adjList = this.toEdgeList().reduce((acc, [v1, v2]) => {
-            acc[v1].push(v2);
-            acc[v2].push(v1);
-            return acc;
-        }, Array.from({ length: this.numVertices }, () => []));
-
-        const dfs = (v) => {
-            visited[v] = true;
-            for (const neighbor of adjList[v]) {
-                if (!visited[neighbor]) {
-                    dfs(neighbor);
-                }
-            }
-        };
-
-        dfs(0);
-
-        return visited.every(v => v === true);
-    }
+    isConnected() {}
 }
 
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/Graph.js:55:13
 
     // Проверка на связность (DFS)
     isConnected() {
-        if (this.numVertices === 0) return true;
+        if (false) return true;
 
         const visited = new Array(this.numVertices).fill(false);
killedBy: ChaiGraphTest isConnected() с numVertices = 0
statusReason: TypeError: adjList[v] is not iterable

[Killed] BooleanLiteral
src/Graph.js:55:44
 
     // Проверка на связность (DFS)
     isConnected() {
-        if (this.numVertices === 0) return true;
+        if (this.numVertices === 0) return false;
 
         const visited = new Array(this.numVertices).fill(false);
killedBy: ChaiGraphTest isConnected() с numVertices = 0
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] BooleanLiteral
src/Graph.js:57:58
     isConnected() {
         if (this.numVertices === 0) return true;
 
-        const visited = new Array(this.numVertices).fill(false);
+        const visited = new Array(this.numVertices).fill(true);
         const adjList = this.toEdgeList().reduce((acc, [v1, v2]) => {
             acc[v1].push(v2);
killedBy: ChaiGraphTest isNotConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  false
Received:
  true

Message:

[Killed] BlockStatement
src/Graph.js:58:69
         if (this.numVertices === 0) return true;
 
         const visited = new Array(this.numVertices).fill(false);
-        const adjList = this.toEdgeList().reduce((acc, [v1, v2]) => {
-            acc[v1].push(v2);
-            acc[v2].push(v1);
-            return acc;
-        }, Array.from({ length: this.numVertices }, () => []));
+        const adjList = this.toEdgeList().reduce((acc, [v1, v2]) => {}, Array.from({ length: this.numVertices }, () => []));
 
         const dfs = (v) => {
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
src/Graph.js:62:53
             acc[v1].push(v2);
             acc[v2].push(v1);
             return acc;
-        }, Array.from({ length: this.numVertices }, () => []));
+        }, Array.from({ length: this.numVertices }, () => undefined));
 
         const dfs = (v) => {
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ObjectLiteral
src/Graph.js:62:23
             acc[v1].push(v2);
             acc[v2].push(v1);
             return acc;
-        }, Array.from({ length: this.numVertices }, () => []));
+        }, Array.from({}, () => []));
 
         const dfs = (v) => {
killedBy: ChaiGraphTest isConnected()
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/Graph.js:64:28
             return acc;
         }, Array.from({ length: this.numVertices }, () => []));
 
-        const dfs = (v) => {
-            visited[v] = true;
-            for (const neighbor of adjList[v]) {
-                if (!visited[neighbor]) {
-                    dfs(neighbor);
-                }
-            }
-        };
+        const dfs = (v) => {};
 
         dfs(0);
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Timeout] BooleanLiteral
src/Graph.js:65:26
         }, Array.from({ length: this.numVertices }, () => []));
 
         const dfs = (v) => {
-            visited[v] = true;
+            visited[v] = false;
             for (const neighbor of adjList[v]) {
                 if (!visited[neighbor]) {

[Killed] BlockStatement
src/Graph.js:66:48
 
         const dfs = (v) => {
             visited[v] = true;
-            for (const neighbor of adjList[v]) {
-                if (!visited[neighbor]) {
-                    dfs(neighbor);
-                }
-            }
+            for (const neighbor of adjList[v]) {}
         };
 
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] BooleanLiteral
src/Graph.js:67:21
         const dfs = (v) => {
             visited[v] = true;
             for (const neighbor of adjList[v]) {
-                if (!visited[neighbor]) {
+                if (visited[neighbor]) {
                     dfs(neighbor);
                 }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ConditionalExpression
src/Graph.js:67:21
         const dfs = (v) => {
             visited[v] = true;
             for (const neighbor of adjList[v]) {
-                if (!visited[neighbor]) {
+                if (false) {
                     dfs(neighbor);
                 }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ArrowFunction
src/Graph.js:75:30
 
         dfs(0);
 
-        return visited.every(v => v === true);
+        return visited.every(() => undefined);
     }
 }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ConditionalExpression
src/Graph.js:75:35
 
         dfs(0);
 
-        return visited.every(v => v === true);
+        return visited.every(v => false);
     }
 }
killedBy: ChaiGraphTest isConnected()
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:
