[Killed] BlockStatement
src/point.js:3:20
 
 class checkPoint {
-    constructor(R) {
-        if (R <= 0) {
-            throw new Error("R must be > 0");
-        }
-        this.R = R;
-    }   
+    constructor(R) {}   
 
     #isInCircle(x, y) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] ConditionalExpression
src/point.js:4:13
 
 class checkPoint {
     constructor(R) {
-        if (R <= 0) {
+        if (true) {
             throw new Error("R must be > 0");
         }
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] BlockStatement
src/point.js:4:21
 
 class checkPoint {
     constructor(R) {
-        if (R <= 0) {
-            throw new Error("R must be > 0");
-        }
+        if (R <= 0) {}
         this.R = R;
     }   
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › R <= 0 вызывает ошибку

[Killed] BlockStatement
src/point.js:10:23
         this.R = R;
     }   
 
-    #isInCircle(x, y) {
-        return Math.pow(x, 2) + Math.pow(y, 2) <= Math.pow(this.R, 2)
-    }
+    #isInCircle(x, y) {}
     #isInCutSector(x, y) {
         const inFourthQuadrant = x > 0 && y < 0;
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] EqualityOperator
src/point.js:11:16
     }   
 
     #isInCircle(x, y) {
-        return Math.pow(x, 2) + Math.pow(y, 2) <= Math.pow(this.R, 2)
+        return Math.pow(x, 2) + Math.pow(y, 2) > Math.pow(this.R, 2)
     }
     #isInCutSector(x, y) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] ConditionalExpression
src/point.js:11:16
     }   
 
     #isInCircle(x, y) {
-        return Math.pow(x, 2) + Math.pow(y, 2) <= Math.pow(this.R, 2)
+        return false
     }
     #isInCutSector(x, y) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] BlockStatement
src/point.js:13:26
     #isInCircle(x, y) {
         return Math.pow(x, 2) + Math.pow(y, 2) <= Math.pow(this.R, 2)
     }
-    #isInCutSector(x, y) {
-        const inFourthQuadrant = x > 0 && y < 0;
-
-        const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
-
-        return inFourthQuadrant || inSecondQuadrant;
-    }
+    #isInCutSector(x, y) {}
     TestPoint(x, y) {
         if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(-2, 4) = 2 область (выше линии y = x + R)

[Killed] EqualityOperator
src/point.js:14:34
         return Math.pow(x, 2) + Math.pow(y, 2) <= Math.pow(this.R, 2)
     }
     #isInCutSector(x, y) {
-        const inFourthQuadrant = x > 0 && y < 0;
+        const inFourthQuadrant = x <= 0 && y < 0;
 
         const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(3, -4) = 2 область (в четвёртом квадранте)

[Killed] ConditionalExpression
src/point.js:14:43
         return Math.pow(x, 2) + Math.pow(y, 2) <= Math.pow(this.R, 2)
     }
     #isInCutSector(x, y) {
-        const inFourthQuadrant = x > 0 && y < 0;
+        const inFourthQuadrant = x > 0 && true;
 
         const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(6, 0) = 3 область (вне круга, правее)

[Killed] EqualityOperator
src/point.js:16:43
     #isInCutSector(x, y) {
         const inFourthQuadrant = x > 0 && y < 0;
 
-        const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
+        const inSecondQuadrant = x < 0 && y >= 0 && y > x + this.R;
 
         return inFourthQuadrant || inSecondQuadrant;
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


PASS tests/checkPointDataDriven.test.js

FAIL tests/checkPoint.test.js

[Killed] EqualityOperator
src/point.js:16:34
     #isInCutSector(x, y) {
         const inFourthQuadrant = x > 0 && y < 0;
 
-        const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
+        const inSecondQuadrant = x >= 0 && y > 0 && y > x + this.R;
 
         return inFourthQuadrant || inSecondQuadrant;
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(-2, 4) = 2 область (выше линии y = x + R)

[Killed] ConditionalExpression
src/point.js:18:16
 
         const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
 
-        return inFourthQuadrant || inSecondQuadrant;
+        return false;
     }
     TestPoint(x, y) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(-2, 4) = 2 область (выше линии y = x + R)

[Killed] ConditionalExpression
src/point.js:18:16
 
         const inSecondQuadrant = x < 0 && y > 0 && y > x + this.R;
 
-        return inFourthQuadrant || inSecondQuadrant;
+        return true;
     }
     TestPoint(x, y) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] BlockStatement
src/point.js:20:21
 
         return inFourthQuadrant || inSecondQuadrant;
     }
-    TestPoint(x, y) {
-        if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {
-            return '1 область'
-        } else if (this.#isInCutSector(x, y)) {
-            return '2 область'
-        } else {
-            return '3 область'
-        }
-    } 
+    TestPoint(x, y) {} 
 }
 
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] ConditionalExpression
src/point.js:21:13
         return inFourthQuadrant || inSecondQuadrant;
     }
     TestPoint(x, y) {
-        if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {
+        if (true) {
             return '1 область'
         } else if (this.#isInCutSector(x, y)) {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(-2, 4) = 2 область (выше линии y = x + R)

[Killed] BlockStatement
src/point.js:21:67
         return inFourthQuadrant || inSecondQuadrant;
     }
     TestPoint(x, y) {
-        if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {
-            return '1 область'
-        } else if (this.#isInCutSector(x, y)) {
+        if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {} else if (this.#isInCutSector(x, y)) {
             return '2 область'
         } else {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(0, 0) = 1 область (центр круга)

[Killed] ConditionalExpression
src/point.js:23:20
     TestPoint(x, y) {
         if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {
             return '1 область'
-        } else if (this.#isInCutSector(x, y)) {
+        } else if (true) {
             return '2 область'
         } else {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(6, 0) = 3 область (вне круга, правее)

[Killed] ConditionalExpression
src/point.js:23:20
     TestPoint(x, y) {
         if (this.#isInCircle(x, y) && !this.#isInCutSector(x, y)) {
             return '1 область'
-        } else if (this.#isInCutSector(x, y)) {
+        } else if (false) {
             return '2 область'
         } else {
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(-2, 4) = 2 область (выше линии y = x + R)

[Killed] BlockStatement
src/point.js:25:16
             return '1 область'
         } else if (this.#isInCutSector(x, y)) {
             return '2 область'
-        } else {
-            return '3 область'
-        }
+        } else {}
     } 
 }
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(6, 0) = 3 область (вне круга, правее)

[Killed] StringLiteral
src/point.js:26:20
         } else if (this.#isInCutSector(x, y)) {
             return '2 область'
         } else {
-            return '3 область'
+            return ""
         }
     } 
killedBy: All tests
statusReason: > lab3@1.0.0 test
> jest


FAIL tests/checkPointDataDriven.test.js

  ● checkPoint - Тестирование, управляемое данными › TestPoint(6, 0) = 3 область (вне круга, правее)
