[Killed] BlockStatement
src/Substrings.js:2:47
 class Substrings{
-    InsertSubstring(str = '', pos, substring) {
-        if (pos < 0) {                                           //1
-            return ''                                            //2
-        }
-
-        if (pos > str.length) {                                  //3
-            return ''                                            //4
-        }
-
-        let result = '';                                          //5
-        for (let i = 0;                                           //6
-            i < str.length;                                       //7
-            i++)                                                  //8
-            {   
-                if (i === pos) {                                  //9
-                    result+=substring;                            //10
-                }
-                result+= str[i];                                  // 11
-                
-            } 
-        return result;                                            //12
-    }  
+    InsertSubstring(str = '', pos, substring) {}  
 } 
 module.exports = Substrings;
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] BlockStatement
src/Substrings.js:3:22
 class Substrings{
     InsertSubstring(str = '', pos, substring) {
-        if (pos < 0) {                                           //1
-            return ''                                            //2
-        }
+        if (pos < 0) {}
 
         if (pos > str.length) {                                  //3
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] EqualityOperator
src/Substrings.js:3:13
 class Substrings{
     InsertSubstring(str = '', pos, substring) {
-        if (pos < 0) {                                           //1
+        if (pos >= 0) {                                           //1
             return ''                                            //2
         }
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] ConditionalExpression
src/Substrings.js:7:13
             return ''                                            //2
         }
 
-        if (pos > str.length) {                                  //3
+        if (true) {                                  //3
             return ''                                            //4
         }
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] BlockStatement
src/Substrings.js:7:31
             return ''                                            //2
         }
 
-        if (pos > str.length) {                                  //3
-            return ''                                            //4
-        }
+        if (pos > str.length) {}
 
         let result = '';                                          //5
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js
  Substrings
    √ str не передан, pos = 0, substring = "x" → "x" (1 ms)
    √ pos = str.length (1 ms)

[Killed] ConditionalExpression
src/Substrings.js:13:13
 
         let result = '';                                          //5
         for (let i = 0;                                           //6
-            i < str.length;                                       //7
+            false;                                       //7
             i++)                                                  //8
             {   
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] EqualityOperator
src/Substrings.js:13:13
 
         let result = '';                                          //5
         for (let i = 0;                                           //6
-            i < str.length;                                       //7
+            //6
+i <= str.length;                                       //7
             i++)                                                  //8
             {   
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Timeout] UpdateOperator
src/Substrings.js:14:13
         let result = '';                                          //5
         for (let i = 0;                                           //6
             i < str.length;                                       //7
-            i++)                                                  //8
+            i--)                                                  //8
             {   
                 if (i === pos) {                                  //9

[Killed] BlockStatement
src/Substrings.js:15:13
         for (let i = 0;                                           //6
             i < str.length;                                       //7
             i++)                                                  //8
-            {   
-                if (i === pos) {                                  //9
-                    result+=substring;                            //10
-                }
-                result+= str[i];                                  // 11
-                
-            } 
+            {} 
         return result;                                            //12
     }  
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] EqualityOperator
src/Substrings.js:16:21
             i < str.length;                                       //7
             i++)                                                  //8
             {   
-                if (i === pos) {                                  //9
+                if (i !== pos) {                                  //9
                     result+=substring;                            //10
                 }
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] ConditionalExpression
src/Substrings.js:16:21
             i < str.length;                                       //7
             i++)                                                  //8
             {   
-                if (i === pos) {                                  //9
+                if (true) {                                  //9
                     result+=substring;                            //10
                 }
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] AssignmentOperator
src/Substrings.js:17:21
             i++)                                                  //8
             {   
                 if (i === pos) {                                  //9
-                    result+=substring;                            //10
+                    result -= substring;                            //10
                 }
                 result+= str[i];                                  // 11
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings

[Killed] AssignmentOperator
src/Substrings.js:19:17
                 if (i === pos) {                                  //9
                     result+=substring;                            //10
                 }
-                result+= str[i];                                  // 11
+                result -= str[i];                                  // 11
                 
             } 
killedBy: All tests
statusReason: > lab4@1.0.0 test
> jest


FAIL tests/substrings.test.js

  Substrings
