[Killed] EqualityOperator
src/Converter.js:3:13
 class BaseConverter {
     from12To16(input) {
-        if (typeof input !== 'string' || !input) {                                                  //1
+        if (typeof input === 'string' || !input) {                                                  //1
             throw new Error('Input должен быть не пустой строкой');                                 //2
         }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ConditionalExpression
src/Converter.js:3:13
 class BaseConverter {
     from12To16(input) {
-        if (typeof input !== 'string' || !input) {                                                  //1
+        if (false) {                                                  //1
             throw new Error('Input должен быть не пустой строкой');                                 //2
         }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] MethodExpression
src/Converter.js:7:17
             throw new Error('Input должен быть не пустой строкой');                                 //2
         }
 
-        input = input.toUpperCase();                                                                //3
+        input = input.toLowerCase();                                                                //3
 
         const validChars = /^[0-9A-B]+$/;                                                           //4
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] Regex
src/Converter.js:9:28
 
         input = input.toUpperCase();                                                                //3
 
-        const validChars = /^[0-9A-B]+$/;                                                           //4
+        const validChars = /^[0-9A-B]+/;                                                           //4
         if (!validChars.test(input)) {                                                              //5
             throw new Error('Некорректные входные данные');                                         //6
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] Regex
src/Converter.js:9:28
 
         input = input.toUpperCase();                                                                //3
 
-        const validChars = /^[0-9A-B]+$/;                                                           //4
+        const validChars = /^[^0-9A-B]+$/;                                                           //4
         if (!validChars.test(input)) {                                                              //5
             throw new Error('Некорректные входные данные');                                         //6
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] BooleanLiteral
src/Converter.js:10:13
         input = input.toUpperCase();                                                                //3
 
         const validChars = /^[0-9A-B]+$/;                                                           //4
-        if (!validChars.test(input)) {                                                              //5
+        if (validChars.test(input)) {                                                              //5
             throw new Error('Некорректные входные данные');                                         //6
         }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ConditionalExpression
src/Converter.js:10:13
         input = input.toUpperCase();                                                                //3
 
         const validChars = /^[0-9A-B]+$/;                                                           //4
-        if (!validChars.test(input)) {                                                              //5
+        if (false) {                                                              //5
             throw new Error('Некорректные входные данные');                                         //6
         }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ArithmeticOperator
src/Converter.js:17:22
         let decimal = 0;                                                                            //7    
         const base12 = 12;                                                                          //8
 
-        for (let i = input.length - 1;                                                              //9
+        for (let i = input.length + 1;                                                              //9
             i >= 0;                                                                                 //10
             i--) {                                                                                  //11
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] EqualityOperator
src/Converter.js:18:13
         const base12 = 12;                                                                          //8
 
         for (let i = input.length - 1;                                                              //9
-            i >= 0;                                                                                 //10
+            //9
+i > 0;                                                                                 //10
             i--) {                                                                                  //11
             const charCode = input.charCodeAt(i);                                                   //12
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js
  Converter
    √ строка начинается с некорректного символа (1 ms)
    Правильные классы эквивалентности

[Killed] EqualityOperator
src/Converter.js:18:13
         const base12 = 12;                                                                          //8
 
         for (let i = input.length - 1;                                                              //9
-            i >= 0;                                                                                 //10
+            //9
+i < 0;                                                                                 //10
             i--) {                                                                                  //11
             const charCode = input.charCodeAt(i);                                                   //12
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] BlockStatement
src/Converter.js:19:18
 
         for (let i = input.length - 1;                                                              //9
             i >= 0;                                                                                 //10
-            i--) {                                                                                  //11
-            const charCode = input.charCodeAt(i);                                                   //12
-            const digit = (charCode <= 57)                                                  //13
-                ? charCode - 48                                                                     //14
-                : charCode - 55;                                                                    //15
-                
-            const term = digit * Math.pow(base12, input.length - 1 - i);                            //16
-
-            if (decimal + term > Number.MAX_SAFE_INTEGER) {                                         //17
-                throw new Error('Превышение Number.MAX_SAFE_INTEGER');                              //18
-            }
-
-            decimal += term;                                                                        //19
-        }
+            i--) {}
 
         if (decimal === 0) return '0';                                                              //20
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Timeout] UpdateOperator
src/Converter.js:19:13
 
         for (let i = input.length - 1;                                                              //9
             i >= 0;                                                                                 //10
-            i--) {                                                                                  //11
+            i++) {                                                                                  //11
             const charCode = input.charCodeAt(i);                                                   //12
             const digit = (charCode <= 57)                                                  //13

[Killed] ConditionalExpression
src/Converter.js:21:28
             i >= 0;                                                                                 //10
             i--) {                                                                                  //11
             const charCode = input.charCodeAt(i);                                                   //12
-            const digit = (charCode <= 57)                                                  //13
+            const digit = (true)                                                  //13
                 ? charCode - 48                                                                     //14
                 : charCode - 55;                                                                    //15
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ConditionalExpression
src/Converter.js:21:28
             i >= 0;                                                                                 //10
             i--) {                                                                                  //11
             const charCode = input.charCodeAt(i);                                                   //12
-            const digit = (charCode <= 57)                                                  //13
+            const digit = (false)                                                  //13
                 ? charCode - 48                                                                     //14
                 : charCode - 55;                                                                    //15
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ArithmeticOperator
src/Converter.js:22:19
             i--) {                                                                                  //11
             const charCode = input.charCodeAt(i);                                                   //12
             const digit = (charCode <= 57)                                                  //13
-                ? charCode - 48                                                                     //14
+                ? charCode + 48 //14                                                                     //14
                 : charCode - 55;                                                                    //15
                 
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ArithmeticOperator
src/Converter.js:23:19
             const charCode = input.charCodeAt(i);                                                   //12
             const digit = (charCode <= 57)                                                  //13
                 ? charCode - 48                                                                     //14
-                : charCode - 55;                                                                    //15
+                : charCode + 55;                                                                    //15
                 
             const term = digit * Math.pow(base12, input.length - 1 - i);                            //16
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js
  Converter
    √ строка начинается с некорректного символа (1 ms)
    Правильные классы эквивалентности

[Killed] ArithmeticOperator
src/Converter.js:25:51
                 ? charCode - 48                                                                     //14
                 : charCode - 55;                                                                    //15
                 
-            const term = digit * Math.pow(base12, input.length - 1 - i);                            //16
+            const term = digit * Math.pow(base12, input.length + 1 - i);                            //16
 
             if (decimal + term > Number.MAX_SAFE_INTEGER) {                                         //17
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ArithmeticOperator
src/Converter.js:25:51
                 ? charCode - 48                                                                     //14
                 : charCode - 55;                                                                    //15
                 
-            const term = digit * Math.pow(base12, input.length - 1 - i);                            //16
+            const term = digit * Math.pow(base12, input.length - 1 + i);                            //16
 
             if (decimal + term > Number.MAX_SAFE_INTEGER) {                                         //17
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] EqualityOperator
src/Converter.js:27:17
                 
             const term = digit * Math.pow(base12, input.length - 1 - i);                            //16
 
-            if (decimal + term > Number.MAX_SAFE_INTEGER) {                                         //17
+            if (decimal + term >= Number.MAX_SAFE_INTEGER) {                                         //17
                 throw new Error('Превышение Number.MAX_SAFE_INTEGER');                              //18
             }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] EqualityOperator
src/Converter.js:27:17
                 
             const term = digit * Math.pow(base12, input.length - 1 - i);                            //16
 
-            if (decimal + term > Number.MAX_SAFE_INTEGER) {                                         //17
+            if (decimal + term <= Number.MAX_SAFE_INTEGER) {                                         //17
                 throw new Error('Превышение Number.MAX_SAFE_INTEGER');                              //18
             }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] AssignmentOperator
src/Converter.js:31:13
                 throw new Error('Превышение Number.MAX_SAFE_INTEGER');                              //18
             }
 
-            decimal += term;                                                                        //19
+            decimal -= term;                                                                        //19
         }
 
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ConditionalExpression
src/Converter.js:34:13
             decimal += term;                                                                        //19
         }
 
-        if (decimal === 0) return '0';                                                              //20
+        if (false) return '0';                                                              //20
 
         let result = '';                                                                            //21
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ConditionalExpression
src/Converter.js:34:13
             decimal += term;                                                                        //19
         }
 
-        if (decimal === 0) return '0';                                                              //20
+        if (true) return '0';                                                              //20
 
         let result = '';                                                                            //21
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] EqualityOperator
src/Converter.js:39:16
         let result = '';                                                                            //21
         const hexChars = '0123456789ABCDEF';                                                        //22
 
-        while (decimal > 0) {                                                                       //23
+        while (decimal <= 0) {                                                                       //23
             result = hexChars[decimal % 16] + result;                                               //24
             decimal = Math.floor(decimal / 16);                                                     //25
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter
    √ строка начинается с некорректного символа (1 ms)

[Killed] ConditionalExpression
src/Converter.js:39:16
         let result = '';                                                                            //21
         const hexChars = '0123456789ABCDEF';                                                        //22
 
-        while (decimal > 0) {                                                                       //23
+        while (false) {                                                                       //23
             result = hexChars[decimal % 16] + result;                                               //24
             decimal = Math.floor(decimal / 16);                                                     //25
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js
  Converter
    √ строка начинается с некорректного символа (2 ms)
    Правильные классы эквивалентности

[Killed] ArithmeticOperator
src/Converter.js:40:31
         const hexChars = '0123456789ABCDEF';                                                        //22
 
         while (decimal > 0) {                                                                       //23
-            result = hexChars[decimal % 16] + result;                                               //24
+            result = hexChars[decimal * 16] + result;                                               //24
             decimal = Math.floor(decimal / 16);                                                     //25
         }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Killed] ArithmeticOperator
src/Converter.js:40:22
         const hexChars = '0123456789ABCDEF';                                                        //22
 
         while (decimal > 0) {                                                                       //23
-            result = hexChars[decimal % 16] + result;                                               //24
+            result = hexChars[decimal % 16] - result;                                               //24
             decimal = Math.floor(decimal / 16);                                                     //25
         }
killedBy: All tests
statusReason: > lab6@1.0.0 test
> jest


FAIL test/converter.test.js

  Converter

[Timeout] ArithmeticOperator
src/Converter.js:41:34
 
         while (decimal > 0) {                                                                       //23
             result = hexChars[decimal % 16] + result;                                               //24
-            decimal = Math.floor(decimal / 16);                                                     //25
+            decimal = Math.floor(decimal * 16);                                                     //25
         }
 
